GaGiaa/pid_lab_h723_m2006/Core/Src/freertos.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : freertos.c
  * Description        : Code for freertos applications
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "usart.h"
#include "vofa_justfloat.h"
#include "m2006_driver.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define VOFA_TIMESTAMP_PERIOD_MS (100U)

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN Variables */
osThreadId_t vofa_timestamp_task_handle;
const osThreadAttr_t vofa_timestamp_task_attributes = {
  .name = "vofa_timestamp",
  .stack_size = 512U,
  .priority = (osPriority_t) osPriorityNormal,
};

osThreadId_t m2006_control_task_handle;
const osThreadAttr_t m2006_control_task_attributes = {
  .name = "m2006_control",
  .stack_size = 1024U,
  .priority = (osPriority_t) osPriorityAboveNormal,
};

/* USER CODE END Variables */
/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 2000 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN FunctionPrototypes */
static void vofa_timestamp_task_entry(void *argument);
static void m2006_control_task_entry(void *argument);

/* USER CODE END FunctionPrototypes */

void startDefaultTask(void *argument);

void MX_FREERTOS_Init(void); /* (MISRA C 2004 rule 8.1) */

/* Hook prototypes */
void vApplicationStackOverflowHook(xTaskHandle xTask, signed char *pcTaskName);

/* USER CODE BEGIN 4 */
void vApplicationStackOverflowHook(xTaskHandle xTask, signed char *pcTaskName)
{
   /* Run time stack overflow checking is performed if
   configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2. This hook function is
   called if a stack overflow is detected. */
}
/* USER CODE END 4 */

/**
  * @brief  FreeRTOS initialization
  * @param  None
  * @retval None
  */
void MX_FREERTOS_Init(void) {
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of defaultTask */
  defaultTaskHandle = osThreadNew(startDefaultTask, NULL, &defaultTask_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  vofa_timestamp_task_handle = osThreadNew(vofa_timestamp_task_entry,
                                            NULL,
                                            &vofa_timestamp_task_attributes);
  m2006_control_task_handle = osThreadNew(m2006_control_task_entry,
                                           NULL,
                                           &m2006_control_task_attributes);
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

}

/* USER CODE BEGIN Header_startDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_startDefaultTask */
__weak void startDefaultTask(void *argument)
{
  /* USER CODE BEGIN startDefaultTask */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END startDefaultTask */
}

/* Private application code --------------------------------------------------*/
/* USER CODE BEGIN Application */
static void m2006_control_task_entry(void *argument)
{
  m2006_driver_init();

  (void)argument;

  for (;;)
  {
    m2006_driver_update();
    osDelay(1U);
  }
}

static void vofa_timestamp_task_entry(void *argument)
{
  uint8_t frame_buffer[VOFA_JUSTFLOAT_FRAME_SIZE_BYTES];

  (void)argument;

  for (;;)
  {
    if (vofa_justfloat_encode_float((float)osKernelGetTickCount(), frame_buffer) ==
        VOFA_JUSTFLOAT_FRAME_SIZE_BYTES)
    {
      (void)HAL_UART_Transmit_DMA(&huart8,
                                  frame_buffer,
                                  VOFA_JUSTFLOAT_FRAME_SIZE_BYTES);
    }

    osDelay(VOFA_TIMESTAMP_PERIOD_MS);
  }
}

/* USER CODE END Application */

